a = []
a.append(10)
print(a)  # [10]

b = [1, 2]
b.extend([3, 4])
print(b)  # [1, 2, 3, 4]

c = [10, 20, 30]
c.insert(2, 500)
print(c)  # [10, 20, 500, 30]

d = [10, 20, 30]
d[1:1] = [50, 60]
print(d)  # [10, 50, 60, 20, 30]

e = [10, 20, 30]
e.pop()  # 30
print(e)  # [10, 20]

f = [10, 20, 30]
del f[1]
print(f)  # [10, 30]

g = [10, 20, 30, 20]
g.remove(20)
print(g)  # [10, 30, 20]

h = [10, 20, 30]
h.index(20)  # 1

i = [10, 20, 30, 30]
i.count(30)  # 2

j = [10, 20, 30, 15, 20, 40]
j.reverse()  # [40, 20, 15, 30, 20, 10]

k = [10, 20, 30, 15, 20, 40]
k.sort()  # [10, 15, 20, 20, 30, 40]
# sorted(k) 하면 새로운 리스트를 생성하고, k 자체를 바꾸지 않음

l = [10, 20, 30]
l.clear()  # []

m = [10, 20, 30]
del m[:]  # []

a = [10, 20, 30]
a[len(a):] = [500]  # [10, 20, 30, 500]

seq = []
if seq:        # 리스트에 내용이 있으면 True
if not seq:    # 리스트가 비어 있으면 True
